Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/atdf/PIC32CM1216LS00064.atdf
      <value-group name="NVMCTRL_NSULCK__NSLKEY">
        <value name="KEY" caption="Write Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_SECCTRL__KEY">
        <value name="KEY" caption="Write Key" value="0xA5"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2802" version="1.1.0" caption="Non-Volatile Fuses">
      <register-group name="BOCOR_FUSES">
        <register name="BOCOR_WORD_0" offset="0x0" rw="RW" size="4" initval="0xF007FFFF" caption="BOCOR Page Word 0">
          <bitfield name="IDAU_BNSC" caption="Boot Non-Secure Callable" mask="0xFF80000"/>
        </register>
        <register name="BOCOR_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFE80000" caption="BOCOR Page Word 1">
          <bitfield name="BOOTROM_BOOTOPT" caption="Boot Option" mask="0xFF"/>
          <bitfield name="IDAU_BOOTPROT" caption="Boot Protection" mask="0x7FF00"/>
          <bitfield name="BOOTROM_SECCFGLOCK" caption="Security Configuration Lock" mask="0x80000"/>
          <bitfield name="BOOTROM_DICEEN" caption="DICE Enable" mask="0x100000"/>
          <bitfield name="NVMCTRL_BCWEN" caption="Boot Configuration Write Enable" mask="0x1000000"/>
          <bitfield name="NVMCTRL_BCREN" caption="Boot Configuration Read Enable" mask="0x2000000"/>
        </register>
        <register name="BOCOR_WORD_2" offset="0x8" rw="RW" size="4" initval="0xC0349ACC" caption="BOCOR Page Word 2">
          <bitfield name="BOOTROM_BOCORCRC" caption="CRC for BOCOR0 DWORD" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_4" offset="0x10" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 4">
          <bitfield name="BOOTROM_CEKEY0_0" caption="Chip Erase Key 0 bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_5" offset="0x14" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 5">
          <bitfield name="BOOTROM_CEKEY0_1" caption="Chip Erase Key 0 bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_6" offset="0x18" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 6">
          <bitfield name="BOOTROM_CEKEY0_2" caption="Chip Erase Key 0 bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_7" offset="0x1C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 7">
          <bitfield name="BOOTROM_CEKEY0_3" caption="Chip Erase Key 0 bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_8" offset="0x20" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 8">
          <bitfield name="BOOTROM_CEKEY1_0" caption="Chip Erase Key 1 bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_9" offset="0x24" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 9">
          <bitfield name="BOOTROM_CEKEY1_1" caption="Chip Erase Key 1 bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_10" offset="0x28" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 10">
          <bitfield name="BOOTROM_CEKEY1_2" caption="Chip Erase Key 1 bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_11" offset="0x2C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 11">
          <bitfield name="BOOTROM_CEKEY1_3" caption="Chip Erase Key 1 bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_12" offset="0x30" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 12">
          <bitfield name="BOOTROM_CEKEY2_0" caption="Chip Erase Key 2 bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_13" offset="0x34" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 13">
          <bitfield name="BOOTROM_CEKEY2_1" caption="Chip Erase Key 2 bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_14" offset="0x38" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 14">
          <bitfield name="BOOTROM_CEKEY2_2" caption="Chip Erase Key 2 bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_15" offset="0x3C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 15">
          <bitfield name="BOOTROM_CEKEY2_3" caption="Chip Erase Key 2 bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_16" offset="0x40" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 16">
          <bitfield name="BOOTROM_CRCKEY_0" caption="Crc Key bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_17" offset="0x44" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 17">
          <bitfield name="BOOTROM_CRCKEY_1" caption="Crc Key bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_18" offset="0x48" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 18">
          <bitfield name="BOOTROM_CRCKEY_2" caption="Crc Key bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_19" offset="0x4C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 19">
          <bitfield name="BOOTROM_CRCKEY_3" caption="Crc Key bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_20" offset="0x50" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 20">
          <bitfield name="BOOTROM_BOOTKEY_0" caption="Secure Boot Key bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_21" offset="0x54" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 21">
          <bitfield name="BOOTROM_BOOTKEY_1" caption="Secure Boot Key bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_22" offset="0x58" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 22">
          <bitfield name="BOOTROM_BOOTKEY_2" caption="Secure Boot Key bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_23" offset="0x5C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 23">
          <bitfield name="BOOTROM_BOOTKEY_3" caption="Secure Boot Key bits 127:96" mask="0xFFFFFFFF"/>
        </register>
