Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/atdf/PIC32CM1216LS00064.atdf
        <register modes="USART_EXT" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART_EXT Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_USART_CTRLB__CHSIZE"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="SERCOM_USART_CTRLB__SBMODE"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400" values="SERCOM_USART_CTRLB__ENC"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="SERCOM_USART_CTRLB__PMODE"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_USART_CTRLB__FIFOCLR"/>
          <bitfield name="LINCMD" caption="LIN Command" mask="0x3000000" values="SERCOM_USART_CTRLB__LINCMD"/>
        </register>
        <register modes="USART_INT" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART_INT Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_USART_CTRLB__CHSIZE"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="SERCOM_USART_CTRLB__SBMODE"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400" values="SERCOM_USART_CTRLB__ENC"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="SERCOM_USART_CTRLB__PMODE"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_USART_CTRLB__FIFOCLR"/>
          <bitfield name="LINCMD" caption="LIN Command" mask="0x3000000" values="SERCOM_USART_CTRLB__LINCMD"/>
        </register>
        <register modes="I2CM" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="I2CM Control C">
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_I2CM_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_I2CM_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="I2CS" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="I2CS Control C">
          <bitfield name="SDASETUP" caption="SDA Setup Time" mask="0xF"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_I2CS_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_I2CS_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="SPIM" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SPIM Control C">
          <bitfield name="ICSPACE" caption="Inter-Character Spacing" mask="0x3F"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_SPIM_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_SPIM_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="SPIS" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SPIS Control C">
          <bitfield name="ICSPACE" caption="Inter-Character Spacing" mask="0x3F"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_SPIM_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_SPIM_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="USART_EXT" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="USART_EXT Control C">
          <bitfield name="GTIME" caption="Guard Time" mask="0x7"/>
          <bitfield name="BRKLEN" caption="LIN Master Break Length" mask="0x300" values="SERCOM_USART_CTRLC__BRKLEN"/>
          <bitfield name="HDRDLY" caption="LIN Master Header Delay" mask="0xC00" values="SERCOM_USART_CTRLC__HDRDLY"/>
          <bitfield name="INACK" caption="Inhibit Not Acknowledge" mask="0x10000"/>
          <bitfield name="DSNACK" caption="Disable Successive NACK" mask="0x20000"/>
          <bitfield name="MAXITER" caption="Maximum Iterations" mask="0x700000"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x3000000" values="SERCOM_USART_CTRLC__DATA32B"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_USART_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_USART_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="USART_INT" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="USART_INT Control C">
          <bitfield name="GTIME" caption="Guard Time" mask="0x7"/>
          <bitfield name="BRKLEN" caption="LIN Master Break Length" mask="0x300" values="SERCOM_USART_CTRLC__BRKLEN"/>
          <bitfield name="HDRDLY" caption="LIN Master Header Delay" mask="0xC00" values="SERCOM_USART_CTRLC__HDRDLY"/>
          <bitfield name="INACK" caption="Inhibit Not Acknowledge" mask="0x10000"/>
          <bitfield name="DSNACK" caption="Disable Successive NACK" mask="0x20000"/>
          <bitfield name="MAXITER" caption="Maximum Iterations" mask="0x700000"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x3000000" values="SERCOM_USART_CTRLC__DATA32B"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_USART_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_USART_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="I2CM" name="BAUD" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="I2CM Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
          <bitfield name="BAUDLOW" caption="Baud Rate Value Low" mask="0xFF00"/>
          <bitfield name="HSBAUD" caption="High Speed Baud Rate Value" mask="0xFF0000"/>
          <bitfield name="HSBAUDLOW" caption="High Speed Baud Rate Value Low" mask="0xFF000000"/>
        </register>
        <register modes="SPIM" name="BAUD" offset="0xC" rw="RW" size="1" initval="0x00" caption="SPIM Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
        </register>
        <register modes="SPIS" name="BAUD" offset="0xC" rw="RW" size="1" initval="0x00" caption="SPIS Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
        </register>
